{"format": "graph-model", "generatedBy": "1.15.0", "convertedBy": "TensorFlow.js Converter v1.3.2", "userDefinedMetadata": {"signature": {"inputs": {"input:0": {"name": "input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "416"}, {"size": "416"}, {"size": "3"}]}}}, "outputs": {"output:0": {"name": "output:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "13"}, {"size": "13"}, {"size": "425"}]}}}}}, "modelTopology": {"node": [{"name": "input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "416"}, {"size": "416"}, {"size": "3"}]}}}}, {"name": "mul_15/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "0-convolutional/filter", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "16"}]}}}}}, {"name": "sub/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "truediv", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiasAdd/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "3-convolutional/filter", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}}}}}, {"name": "sub_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "truediv_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "BiasAdd_1/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "6-convolutional/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "sub_2/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "truediv_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiasAdd_2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "9-convolutional/filter", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}}}, {"name": "sub_3/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "truediv_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiasAdd_3/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "12-convolutional/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "sub_4/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "truediv_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiasAdd_4/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "15-convolutional/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "sub_5/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "truediv_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiasAdd_5/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "18-convolutional/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "sub_6/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "truediv_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiasAdd_6/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "20-convolutional/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1024"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "sub_7/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "truediv_7", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "BiasAdd_7/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "22-convolutional/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "425"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BiasAdd_8/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "425"}]}}}}}, {"name": "Pad", "op": "Pad", "input": ["input", "Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "0-convolutional", "op": "Conv2D", "input": ["Pad", "0-convolutional/filter"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "sub", "op": "Sub", "input": ["0-convolutional", "sub/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul", "op": "Mul", "input": ["sub", "truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BiasAdd", "op": "BiasAdd", "input": ["mul", "BiasAdd/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "mul_1", "op": "Mul", "input": ["BiasAdd", "mul_15/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "1-leaky", "op": "Maximum", "input": ["mul_1", "BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "2-maxpool", "op": "MaxPool", "input": ["1-leaky"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "Pad_1", "op": "Pad", "input": ["2-maxpool", "Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "3-convolutional", "op": "Conv2D", "input": ["Pad_1", "3-convolutional/filter"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "sub_1", "op": "Sub", "input": ["3-convolutional", "sub_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_2", "op": "Mul", "input": ["sub_1", "truediv_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BiasAdd_1", "op": "BiasAdd", "input": ["mul_2", "BiasAdd_1/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "mul_3", "op": "Mul", "input": ["BiasAdd_1", "mul_15/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "4-leaky", "op": "Maximum", "input": ["mul_3", "BiasAdd_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "5-maxpool", "op": "MaxPool", "input": ["4-leaky"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "Pad_2", "op": "Pad", "input": ["5-maxpool", "Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "6-convolutional", "op": "Conv2D", "input": ["Pad_2", "6-convolutional/filter"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "sub_2", "op": "Sub", "input": ["6-convolutional", "sub_2/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_4", "op": "Mul", "input": ["sub_2", "truediv_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BiasAdd_2", "op": "BiasAdd", "input": ["mul_4", "BiasAdd_2/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "mul_5", "op": "Mul", "input": ["BiasAdd_2", "mul_15/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "7-leaky", "op": "Maximum", "input": ["mul_5", "BiasAdd_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "8-maxpool", "op": "MaxPool", "input": ["7-leaky"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "Pad_3", "op": "Pad", "input": ["8-maxpool", "Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "9-convolutional", "op": "Conv2D", "input": ["Pad_3", "9-convolutional/filter"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "sub_3", "op": "Sub", "input": ["9-convolutional", "sub_3/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_6", "op": "Mul", "input": ["sub_3", "truediv_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BiasAdd_3", "op": "BiasAdd", "input": ["mul_6", "BiasAdd_3/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "mul_7", "op": "Mul", "input": ["BiasAdd_3", "mul_15/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "10-leaky", "op": "Maximum", "input": ["mul_7", "BiasAdd_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "11-maxpool", "op": "MaxPool", "input": ["10-leaky"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "Pad_4", "op": "Pad", "input": ["11-maxpool", "Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "12-convolutional", "op": "Conv2D", "input": ["Pad_4", "12-convolutional/filter"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "sub_4", "op": "Sub", "input": ["12-convolutional", "sub_4/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_8", "op": "Mul", "input": ["sub_4", "truediv_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BiasAdd_4", "op": "BiasAdd", "input": ["mul_8", "BiasAdd_4/bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "mul_9", "op": "Mul", "input": ["BiasAdd_4", "mul_15/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "13-leaky", "op": "Maximum", "input": ["mul_9", "BiasAdd_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "14-maxpool", "op": "MaxPool", "input": ["13-leaky"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "Pad_5", "op": "Pad", "input": ["14-maxpool", "Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "15-convolutional", "op": "Conv2D", "input": ["Pad_5", "15-convolutional/filter"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "sub_5", "op": "Sub", "input": ["15-convolutional", "sub_5/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_10", "op": "Mul", "input": ["sub_5", "truediv_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BiasAdd_5", "op": "BiasAdd", "input": ["mul_10", "BiasAdd_5/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "mul_11", "op": "Mul", "input": ["BiasAdd_5", "mul_15/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "16-leaky", "op": "Maximum", "input": ["mul_11", "BiasAdd_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "17-maxpool", "op": "MaxPool", "input": ["16-leaky"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "Pad_6", "op": "Pad", "input": ["17-maxpool", "Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "18-convolutional", "op": "Conv2D", "input": ["Pad_6", "18-convolutional/filter"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "sub_6", "op": "Sub", "input": ["18-convolutional", "sub_6/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_12", "op": "Mul", "input": ["sub_6", "truediv_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BiasAdd_6", "op": "BiasAdd", "input": ["mul_12", "BiasAdd_6/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "mul_13", "op": "Mul", "input": ["BiasAdd_6", "mul_15/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "19-leaky", "op": "Maximum", "input": ["mul_13", "BiasAdd_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Pad_7", "op": "Pad", "input": ["19-leaky", "Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "20-convolutional", "op": "Conv2D", "input": ["Pad_7", "20-convolutional/filter"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "sub_7", "op": "Sub", "input": ["20-convolutional", "sub_7/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "mul_14", "op": "Mul", "input": ["sub_7", "truediv_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BiasAdd_7", "op": "BiasAdd", "input": ["mul_14", "BiasAdd_7/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "mul_15", "op": "Mul", "input": ["BiasAdd_7", "mul_15/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "21-leaky", "op": "Maximum", "input": ["mul_15", "BiasAdd_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BiasAdd_8", "op": "_FusedConv2D", "input": ["21-leaky", "22-convolutional/filter", "BiasAdd_8/bias"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "output", "op": "Identity", "input": ["BiasAdd_8"], "attr": {"T": {"type": "DT_FLOAT"}}}], "versions": {"producer": 134, "minConsumer": 12}}, "weightsManifest": [{"paths": ["group1-shard1of11.bin", "group1-shard2of11.bin", "group1-shard3of11.bin", "group1-shard4of11.bin", "group1-shard5of11.bin", "group1-shard6of11.bin", "group1-shard7of11.bin", "group1-shard8of11.bin", "group1-shard9of11.bin", "group1-shard10of11.bin", "group1-shard11of11.bin"], "weights": [{"name": "mul_15/x", "shape": [], "dtype": "float32"}, {"name": "Pad/paddings", "shape": [4, 2], "dtype": "int32"}, {"name": "0-convolutional/filter", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "sub/y", "shape": [16], "dtype": "float32"}, {"name": "truediv", "shape": [16], "dtype": "float32"}, {"name": "BiasAdd/bias", "shape": [16], "dtype": "float32"}, {"name": "3-convolutional/filter", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "sub_1/y", "shape": [32], "dtype": "float32"}, {"name": "truediv_1", "shape": [32], "dtype": "float32"}, {"name": "BiasAdd_1/bias", "shape": [32], "dtype": "float32"}, {"name": "6-convolutional/filter", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "sub_2/y", "shape": [64], "dtype": "float32"}, {"name": "truediv_2", "shape": [64], "dtype": "float32"}, {"name": "BiasAdd_2/bias", "shape": [64], "dtype": "float32"}, {"name": "9-convolutional/filter", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "sub_3/y", "shape": [128], "dtype": "float32"}, {"name": "truediv_3", "shape": [128], "dtype": "float32"}, {"name": "BiasAdd_3/bias", "shape": [128], "dtype": "float32"}, {"name": "12-convolutional/filter", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "sub_4/y", "shape": [256], "dtype": "float32"}, {"name": "truediv_4", "shape": [256], "dtype": "float32"}, {"name": "BiasAdd_4/bias", "shape": [256], "dtype": "float32"}, {"name": "15-convolutional/filter", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "sub_5/y", "shape": [512], "dtype": "float32"}, {"name": "truediv_5", "shape": [512], "dtype": "float32"}, {"name": "BiasAdd_5/bias", "shape": [512], "dtype": "float32"}, {"name": "18-convolutional/filter", "shape": [3, 3, 512, 1024], "dtype": "float32"}, {"name": "sub_6/y", "shape": [1024], "dtype": "float32"}, {"name": "truediv_6", "shape": [1024], "dtype": "float32"}, {"name": "BiasAdd_6/bias", "shape": [1024], "dtype": "float32"}, {"name": "20-convolutional/filter", "shape": [3, 3, 1024, 512], "dtype": "float32"}, {"name": "sub_7/y", "shape": [512], "dtype": "float32"}, {"name": "truediv_7", "shape": [512], "dtype": "float32"}, {"name": "BiasAdd_7/bias", "shape": [512], "dtype": "float32"}, {"name": "22-convolutional/filter", "shape": [1, 1, 512, 425], "dtype": "float32"}, {"name": "BiasAdd_8/bias", "shape": [425], "dtype": "float32"}]}]}